#+TITLE config.org
#+AUTHOR Tibor Schneider
#+DATE 22.12.2018

#+PROPERTY: header-args :tangle yes

** C#
Enable and configure omnisharp in csharp mode
#+BEGIN_SRC emacs-lisp
(setq omnisharp-server-executable-path "/opt/omnisharp/run")

(add-hook 'csharp-mode-hook 'omnisharp-mode)

(setq indent-tabs-mode nil)
(setq c-syntactic-indentation t)
;(c-set-style "ellemtel")
(setq c-basic-offset 4)
(setq truncate-lines t)
(setq tab-width 4)
(setq evil-shift-width 4)

;(local-set-key (kbd "C-c r r") 'omnisharp-run-code-action-refactoring)
;(local-set-key (kbd "C-c C-c") 'recompile)
#+END_SRC

#+RESULTS:
: 4

Enable Company
#+BEGIN_SRC emacs-lisp
(eval-after-load
 'company
 '(add-to-list 'company-backends 'company-omnisharp))

(add-hook 'csharp-mode-hook #'company-mode)
#+END_SRC

Enable Flycheck
#+BEGIN_SRC emacs-lisp
(add-hook 'csharp-mode-hook #'flycheck-mode)
#+END_SRC
